import React from "react";
import { Link } from "react-router-dom";
import s from "./info.module.css"

function Info() {
  return (

    <div className={s.wraper}>
      <p className={s.sub_par}>bank</p>
      <div className={s.text_wrap}>
        <div className={s.tg_link}>


          <a href="https://www.google.com/url?q=https%3A%2F%2Ft.me%2Fmaybebank&sa=D&sntz=1&usg=AOvVaw2AaoFQ9VzFPQRY7HIW3P4p">
            <svg width="30" height="30" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clipPath="url(#clip0_17_24)">
                <path d="M48 24C48 10.7452 37.2548 0 24 0C10.7452 0 0 10.7452 0 24C0 35.9789 8.77641 45.908 20.25 47.7084V30.9375H14.1562V24H20.25V18.7125C20.25 12.6975 23.8331 9.375 29.3152 9.375C31.9402 9.375 34.6875 9.84375 34.6875 9.84375V15.75H31.6613C28.68 15.75 27.75 17.6002 27.75 19.5V24H34.4062L33.3422 30.9375H27.75V47.7084C39.2236 45.908 48 35.9789 48 24Z" fill="#1877F2" />
                <path d="M33.3422 30.9375L34.4062 24H27.75V19.5C27.75 17.602 28.68 15.75 31.6613 15.75H34.6875V9.84375C34.6875 9.84375 31.9411 9.375 29.3152 9.375C23.8331 9.375 20.25 12.6975 20.25 18.7125V24H14.1562V30.9375H20.25V47.7084C22.7349 48.0972 25.2651 48.0972 27.75 47.7084V30.9375H33.3422Z" fill="white" />
              </g>
              <defs>
                <clipPath id="clip0_17_24">
                  <rect width="48" height="48" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <p>
              Додаткові медіа-файли для всіх товарів Telegram - maybebank
            </p>

          </a>
          
        </div>
        <div className={s.ul_lists}>
        <p>Дропшипінг</p>
          <ul>
            <li>Як це працює?</li>
            <li>Виставляєте товар, додавши свою націнку</li>
            <li>Знаходите покупця</li>
            <li>Надсилаєте нам дані замовлення</li>
            <li>Ми відпраляємо посилку</li>
            <li>Після отримання покупцем товару, ви отримуєте свою націнку на картку</li>
            <li>Подробиці оплати <Link>ТУТ</Link> </li>
          </ul>
          <ul>
            <li>Предоплата</li>
            <li>Для першого продажу діє предоплата за доставку 100 грн (у разі відмови покупцем)</li>
            <li>Для подальших продажів предоплата не потрібна. У разі відмови мейбі покриє витрати на доставку</li>
          </ul>
          <ul>
            <li>Необхідна інформація</li>
            <li>Товар</li>
            <li>Дані покупця для доставки (ФІО, номер телефону, місто, № відділення - укр або нова пошта)</li>
            <li>Загальна вартість для покупця (з вашою націнкою)</li>
          </ul>
          <ul>
            <li>Рейтинг дропшиперів</li>
            <li>для тих, хто має 10+ успішних замовлень на місяць, ціни на всі товари будуть знижені -10 грн</li>
            <li>для тих, хто має 50+ успішних замовлень на місяць, ціни на всі товари будуть знижені -50 грн</li>
            <li>для тих, хто має 100+ усп... не треба брехати</li>
          </ul>
        </div>
      </div>
      <div className={s.icons}>
          <div className={s.wraper}>
              <div></div>
              <div></div>
              <div></div>
          </div>
      </div>
      <div className={s.sub_footer}>
        <p>Політика конфіденційності</p>
        <p>Публічний договір</p>
        <p>Контактні дані</p>
        <p>Про компанію</p>
        <div className={s.gr_text}>
<p> Якщо ти віднайдеш у своему серці турботу про когось іншого, ти досягнеш успіху </p>
        </div>
      </div>

    </div>
  );
}

export default Info;